Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 1024, 128, 1)]    0         
_________________________________________________________________
conv2d (Conv2D)              (None, 1024, 128, 16)     160       
_________________________________________________________________
batch_normalization (BatchNo (None, 1024, 128, 16)     64        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 1024, 128, 16)     0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 512, 64, 16)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 512, 64, 32)       4640      
_________________________________________________________________
batch_normalization_1 (Batch (None, 512, 64, 32)       128       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 512, 64, 32)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 256, 32, 32)       0         
_________________________________________________________________
dropout (Dropout)            (None, 256, 32, 32)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 256, 32, 48)       13872     
_________________________________________________________________
batch_normalization_2 (Batch (None, 256, 32, 48)       192       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 256, 32, 48)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 128, 16, 48)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 128, 16, 48)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 16, 64)       27712     
_________________________________________________________________
batch_normalization_3 (Batch (None, 128, 16, 64)       256       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 128, 16, 64)       0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 128, 16, 64)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 128, 16, 80)       46160     
_________________________________________________________________
batch_normalization_4 (Batch (None, 128, 16, 80)       320       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 128, 16, 80)       0         
_________________________________________________________________
reshape (Reshape)            (None, 128, 1280)         0         
_________________________________________________________________
bidirectional (Bidirectional (None, 128, 512)          3147776   
_________________________________________________________________
bidirectional_1 (Bidirection (None, 128, 512)          1574912   
_________________________________________________________________
bidirectional_2 (Bidirection (None, 128, 512)          1574912   
_________________________________________________________________
bidirectional_3 (Bidirection (None, 128, 512)          1574912   
_________________________________________________________________
bidirectional_4 (Bidirection (None, 128, 512)          1574912   
_________________________________________________________________
dropout_3 (Dropout)          (None, 128, 512)          0         
_________________________________________________________________
dense (Dense)                (None, 128, 98)           50274     
=================================================================
Total params: 9,591,202
Trainable params: 9,590,722
Non-trainable params: 480
_________________________________________________________________
