Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, None, None, 3 0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, None, None, 6 1792        input_2[0][0]                    
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, None, None, 6 36928       block1_conv1[0][0]               
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, None, None, 6 0           block1_conv2[0][0]               
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, None, None, 1 73856       block1_pool[0][0]                
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, None, None, 1 147584      block2_conv1[0][0]               
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, None, None, 1 0           block2_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, None, None, 2 295168      block2_pool[0][0]                
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, None, None, 2 590080      block3_conv1[0][0]               
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, None, None, 2 590080      block3_conv2[0][0]               
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, None, None, 2 0           block3_conv3[0][0]               
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, None, None, 5 1180160     block3_pool[0][0]                
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, None, None, 5 2359808     block4_conv1[0][0]               
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, None, None, 5 2359808     block4_conv2[0][0]               
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)      (None, None, None, 5 0           block4_conv3[0][0]               
__________________________________________________________________________________________________
block5_conv1 (Conv2D)           (None, None, None, 5 2359808     block4_pool[0][0]                
__________________________________________________________________________________________________
block5_conv2 (Conv2D)           (None, None, None, 5 2359808     block5_conv1[0][0]               
__________________________________________________________________________________________________
block5_conv3 (Conv2D)           (None, None, None, 5 2359808     block5_conv2[0][0]               
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, None, 4)      0                                            
__________________________________________________________________________________________________
roi_pooling_conv_1 (ROIPoolingC (None, 32, 7, 7, 512 0           block5_conv3[0][0]               
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 32, 25088)    0           roi_pooling_conv_1[0][0]         
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 32, 4096)     102764544   time_distributed_1[0][0]         
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 32, 4096)     0           time_distributed_2[0][0]         
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, 32, 4096)     16781312    time_distributed_3[0][0]         
__________________________________________________________________________________________________
rpn_conv1 (Conv2D)              (None, None, None, 5 2359808     block5_conv3[0][0]               
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, 32, 4096)     0           time_distributed_4[0][0]         
__________________________________________________________________________________________________
rpn_out_class (Conv2D)          (None, None, None, 9 4617        rpn_conv1[0][0]                  
__________________________________________________________________________________________________
rpn_out_regress (Conv2D)        (None, None, None, 3 18468       rpn_conv1[0][0]                  
__________________________________________________________________________________________________
dense_class_14 (TimeDistributed (None, 32, 14)       57358       time_distributed_5[0][0]         
__________________________________________________________________________________________________
dense_regress_14 (TimeDistribut (None, 32, 52)       213044      time_distributed_5[0][0]         
==================================================================================================
Total params: 136,913,839
Trainable params: 136,913,839
Non-trainable params: 0
__________________________________________________________________________________________________
