Epochs = 100
early_stop = no
Test loss: 1.4222359123205608
Test accuracy: 0.7842348217964172

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 28, 28, 1)         0         
_________________________________________________________________
conv0 (Conv2D)               (None, 26, 26, 32)        320       
_________________________________________________________________
bn0 (BatchNormalization)     (None, 26, 26, 32)        128       
_________________________________________________________________
activation_1 (Activation)    (None, 26, 26, 32)        0         
_________________________________________________________________
conv1 (Conv2D)               (None, 24, 24, 32)        9248      
_________________________________________________________________
bn1 (BatchNormalization)     (None, 24, 24, 32)        128       
_________________________________________________________________
activation_2 (Activation)    (None, 24, 24, 32)        0         
_________________________________________________________________
MP1 (MaxPooling2D)           (None, 12, 12, 32)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 10, 10, 64)        18496     
_________________________________________________________________
bn2 (BatchNormalization)     (None, 10, 10, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 10, 10, 64)        0         
_________________________________________________________________
conv3 (Conv2D)               (None, 8, 8, 64)          36928     
_________________________________________________________________
bn3 (BatchNormalization)     (None, 8, 8, 64)          256       
_________________________________________________________________
activation_4 (Activation)    (None, 8, 8, 64)          0         
_________________________________________________________________
MP2 (MaxPooling2D)           (None, 4, 4, 64)          0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4, 4, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1024)              0         
_________________________________________________________________
fc1 (Dense)                  (None, 256)               262400    
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
fco (Dense)                  (None, 85)                21845     
=================================================================
Total params: 350,005
Trainable params: 349,621
Non-trainable params: 384
_________________________________________________________________
None
Train on 573464 samples, validate on 134702 samples
