Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 1024, 128, 1)]    0         
_________________________________________________________________
reshape (Reshape)            (None, 512, 64, 4)        0         
_________________________________________________________________
conv2d (Conv2D)              (None, 512, 64, 8)        296       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 256, 16, 16)       1040      
_________________________________________________________________
gated_conv2d (GatedConv2D)   (None, 256, 16, 16)       2320      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 256, 16, 32)       4640      
_________________________________________________________________
gated_conv2d_1 (GatedConv2D) (None, 256, 16, 32)       9248      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 4, 64)        16448     
_________________________________________________________________
gated_conv2d_2 (GatedConv2D) (None, 128, 4, 64)        36928     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 128, 4, 128)       73856     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 128, 1, 128)       0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 128, 128)          0         
_________________________________________________________________
bidirectional (Bidirectional (None, 128, 256)          263168    
_________________________________________________________________
dense (Dense)                (None, 128, 128)          32896     
_________________________________________________________________
bidirectional_1 (Bidirection (None, 128, 256)          263168    
_________________________________________________________________
dense_1 (Dense)              (None, 128, 98)           25186     
=================================================================
Total params: 729,194
Trainable params: 729,194
Non-trainable params: 0
_________________________________________________________________
